export const MESSAGES = [
  {
    id: 'MSG-0001',
    message: 'Loading....',
  },
  {
    id: 'MSG-0002',
    message: 'System Error :(',
  },
  {
    id: 'MSG-0003',
    message: '変更内容がすべて破棄されますがよろしいでしょうか。',
  },
  {
    id: 'ERR-0089',
    message: '契約本数の指定が正しくありません。',
  },
  {
    id: 'MSG-FR-INF-00001',
    message:
      '業務完了してもよろしいでしょうか？\n業務完了すると夜間バッチを開始します。\n※確定していない当画面の編集内容は破棄されます。',
  },
  {
    id: 'MSG-FR-INF-00002',
    message:
      '確定していない当画面の編集内容は破棄されます。\n継続してよろしいですか？',
  },
  {
    id: 'MSG-FR-INF-00003',
    message:
      '{0}の検索件数が保持上限数を超えたため{2}件で区切りました。（検索結果：{1}件）',
  },
  {
    id: 'MSG-FR-INF-00004',
    message:
      '検索件数が保持上限数を超えたため{1}件で区切りました。（検索結果：{0}件）',
  },
  {
    id: 'MSG-FR-INF-00005',
    message: '変更内容がすべて破棄されますがよろしいでしょうか。',
  },
  {
    id: 'MSG-FR-INF-00006',
    message: '登録・変更内容を確定してよろしいでしょうか',
  },
  {
    id: 'MSG-FR-INF-00007',
    message: '申請データ（未提出）を登録しますがよろしいでしょうか',
  },
  {
    id: 'MSG-FR-INF-00008',
    message: '登録データが破棄されますがよろしいでしょうか',
  },
  {
    id: 'MSG-FR-INF-00009',
    message: '申請内容を確定してよろしいでしょうか',
  },
  {
    id: 'MSG-FR-INF-00010',
    message: '申請ID{1}について、通知確認が実行されました。',
  },
  {
    id: 'MSG-FR-INF-00011',
    message:
      '一つの申請の別の承認段階に、同名の承認者が設定されています。承認段階ごとに別の承認者となるよう設定してください。',
  },
  {
    id: 'MSG-FR-INF-00012',
    message: '変更前コースに紐づく一部サービスが選択できなくなっています',
  },
  {
    id: 'MSG-FR-INF-00013',
    message: '本日の通知はありません',
  },
  {
    id: 'MSG-FR-INF-00014',
    message: 'バッチの実行予約を行いますが、よろしいでしょうか？',
  },
  {
    id: 'MSG-FR-INF-00015',
    message:
      '実行予約は１日１回のみ可能です。実行予約を行ってよろしいでしょうか？',
  },
  {
    id: 'MSG-FR-INF-00016',
    message: '正常に終了しました。',
  },
  {
    id: 'MSG-FR-INF-00017',
    message: '検索結果がありません。',
  },
  {
    id: 'MSG-FR-WRN-00002',
    message:
      '役職ID「{0}」：終了日が設定された役職に紐づいている権限IDは他では使用されていません。',
  },
  {
    id: 'MSG-FR-WRN-00003',
    message: '相殺対象債権が該当なしの為、未提出の入金伝票が作成されます。',
  },
  {
    id: 'MSG-FR-WRN-00004',
    message: '預かり金一覧に償却が設定されていますがよろしいでしょうか',
  },
  {
    id: 'MSG-FR-WRN-00005',
    message: '出金保留一覧に償却が設定されていますがよろしいでしょうか',
  },
  {
    id: 'MSG-FR-WRN-00006',
    message: '請求先IDが選択されていません',
  },
  {
    id: 'MSG-FR-WRN-00007',
    message: 'キャンセルします。よろしいでしょうか。',
  },
  {
    id: 'MSG-FR-WRN-00008',
    message:
      '出品店契約IDと落札店契約IDがどちらも元の取引のIDと異なりますがよろしいでしょうか。',
  },
  {
    id: 'MSG-FR-WRN-00009',
    message: '未入金買取ですがよろしいでしょうか。',
  },
  {
    id: 'MSG-FR-ERR-00001',
    message: '条件明細が追加可能な上限（{0}件）を超えています。',
  },
  {
    id: 'MSG-FR-ERR-00002',
    message: '条件値が追加可能な上限（{0}件）を超えています。',
  },
  {
    id: 'MSG-FR-ERR-00003',
    message: '明細数が表示可能な上限（{0}件）を超えています。',
  },
  {
    id: 'MSG-FR-ERR-00004',
    message: '対象が選択されていません。',
  },
  {
    id: 'MSG-FR-ERR-00005',
    message: '承認者を入力してください。',
  },
  {
    id: 'MSG-FR-ERR-00006',
    message: '承認者を正しい組み合わせで入力してください。',
  },
  {
    id: 'MSG-FR-ERR-00007',
    message: '承認者が何も設定されていません。',
  },
  {
    id: 'MSG-FR-ERR-00011',
    message: '事業拠点情報は既に登録されています',
  },
  {
    id: 'MSG-FR-ERR-00014',
    message: 'ファイルが選択されていません。',
  },
  {
    id: 'MSG-FR-ERR-00015',
    message: 'ファイルが存在しません。',
  },
  {
    id: 'MSG-FR-ERR-00016',
    message: '組織ID「{0}」の適用開始日が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00017',
    message: '組織ID「{0}」の期間に誤りがあります。',
  },
  {
    id: 'MSG-FR-ERR-00020',
    message: '役職ID「{0}」の適用開始日が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00021',
    message: '役職ID「{0}」の期間に誤りがあります。',
  },
  {
    id: 'MSG-FR-ERR-00024',
    message: '従業員ID「{0}」の適用開始日が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00025',
    message: '従業員ID「{0}」の期間に誤りがあります。',
  },
  {
    id: 'MSG-FR-ERR-00026',
    message: '従業員ID「{0}」　従業員IDが重複しています。',
  },
  {
    id: 'MSG-FR-ERR-00027',
    message: '従業員ID「{0}」　従業員IDに誤りがあります。',
  },
  {
    id: 'MSG-FR-ERR-00028',
    message: '従業員ID「{0}」　SFIDが重複しています。',
  },
  {
    id: 'MSG-FR-ERR-00029',
    message: '従業員ID「{0}」　組織１～組織４のいずれかを入力してください。',
  },
  {
    id: 'MSG-FR-ERR-00030',
    message:
      '従業員ID「{0}」　組織ID/名称、役職ID/名称、適用開始日を入力してください。',
  },
  {
    id: 'MSG-FR-ERR-00039',
    message: '期間が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00040',
    message: '債務伝票の入力がありません。',
  },
  {
    id: 'MSG-FR-ERR-00041',
    message: '債務一覧の入力項目（メモを除く）が全て入力されていません。',
  },
  {
    id: 'MSG-FR-ERR-00042',
    message: '入力された金額の合計が、債務金額と異なります。',
  },
  {
    id: 'MSG-FR-ERR-00043',
    message: '出金種別の入力が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00044',
    message: '出金種別に自社取引以外は指定できません。',
  },
  {
    id: 'MSG-FR-ERR-00045',
    message: '銀行振込の場合は、過去日付を指定できません。',
  },
  {
    id: 'MSG-FR-ERR-00046',
    message: '明細が選択されていrません',
  },
  {
    id: 'MSG-FR-ERR-00049',
    message: '範囲指定が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00050',
    message: '期間が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00051',
    message: '期間が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00052',
    message: '範囲指定が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00053',
    message: '画面入力内容が編集されていません',
  },
  {
    id: 'MSG-FR-ERR-00055',
    message: '営業（四輪）は上から順に入力してください',
  },
  {
    id: 'MSG-FR-ERR-00056',
    message: '営業（二輪）は上から順に入力してください',
  },
  {
    id: 'MSG-FR-ERR-00057',
    message:
      '二輪連携用情報がコピー元と一致しませんので物流拠点コピーを解除してください',
  },
  {
    id: 'MSG-FR-ERR-00058',
    message: 'FAX、または、アドレスを入力してください',
  },
  {
    id: 'MSG-FR-ERR-00059',
    message: '支払延長与信は基本法人与信額を下回る金額で入力してください',
  },
  {
    id: 'MSG-FR-ERR-00060',
    message:
      '四輪の即時出金限度金額と即時出金対象譲渡書類未到達限度金額が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00061',
    message:
      '二輪の即時出金限度金額と即時出金対象譲渡書類未到達限度金額が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00062',
    message: '帳票作成日（FROM）以降の帳票作成日（TO）を指定してください',
  },
  {
    id: 'MSG-FR-ERR-00063',
    message: '残額は0以上としてください',
  },
  {
    id: 'MSG-FR-ERR-00064',
    message: '充当金額合計の差額が0ではありません',
  },
  {
    id: 'MSG-FR-ERR-00065',
    message: '相殺順位は1から順に設定してください',
  },
  {
    id: 'MSG-FR-ERR-00067',
    message: '処理内容は相殺予約取消のみ選択可能です',
  },
  {
    id: 'MSG-FR-ERR-00068',
    message: '処理内容は対象外取消のみ選択可能です',
  },
  {
    id: 'MSG-FR-ERR-00069',
    message: '債権処理対象に対して既に消込申請がされています',
  },
  {
    id: 'MSG-FR-ERR-00070',
    message: '預かり金処理対象に対して既に消込申請がされています',
  },
  {
    id: 'MSG-FR-ERR-00071',
    message: '{0}の処理金額にマイナス金額が設定されています',
  },
  {
    id: 'MSG-FR-ERR-00072',
    message: '処理内容①、処理金額⓵から順に設定してください',
  },
  {
    id: 'MSG-FR-ERR-00073',
    message: '処理内容①、処理内容⓶で同一の処理内容が設定されています',
  },
  {
    id: 'MSG-FR-ERR-00074',
    message: '出金保留対象が既に保留解除されています',
  },
  {
    id: 'MSG-FR-ERR-00075',
    message: '契約ID、または、法人ID、請求先IDを入力し検索してください',
  },
  {
    id: 'MSG-FR-ERR-00076',
    message: '有効期間開始日が正しくありません',
  },
  {
    id: 'MSG-FR-ERR-00080',
    message: '変更箇所がありません',
  },
  {
    id: 'MSG-FR-ERR-00081',
    message: '整数のみ入力可能です',
  },
  {
    id: 'MSG-FR-ERR-00082',
    message: '価格設定が設定されておりません。',
  },
  {
    id: 'MSG-FR-ERR-00083',
    message: '{0}の{1}は過去日です',
  },
  {
    id: 'MSG-FR-ERR-00084',
    message: '{1}は過去日です',
  },
  {
    id: 'MSG-FR-ERR-00085',
    message: '{0}の{1}はFromより以降の日付です',
  },
  {
    id: 'MSG-FR-ERR-00086',
    message: '{1}はFromより以降の日付です',
  },
  {
    id: 'MSG-FR-ERR-00087',
    message: 'キャンペーンコードが重複しています',
  },
  {
    id: 'MSG-FR-ERR-00088',
    message: '{0}の連携対象サービスが重複しています',
  },
  {
    id: 'MSG-FR-ERR-00089',
    message: '契約本数の指定が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00090',
    message: '{0} ジョブが異常終了しました。',
  },
  {
    id: 'MSG-FR-ERR-00091',
    message: '{0} ジョブの{1}が異常終了しました。',
  },
  {
    id: 'MSG-FR-ERR-00092',
    message: '{0} ジョブが異常終了しました。',
  },
  {
    id: 'MSG-FR-ERR-00093',
    message: '{0} {1}の作成に失敗しました。',
  },
  {
    id: 'MSG-FR-ERR-00094',
    message: '{0} {1}の更新に失敗しました。',
  },
  {
    id: 'MSG-FR-ERR-00095',
    message: '{0} {1}の作成に失敗しました。{2}：{3}',
  },
  {
    id: 'MSG-FR-ERR-00096',
    message: '{0} {1}の更新に失敗しました。{2}：{3}',
  },
  {
    id: 'MSG-FR-ERR-00097',
    message: '{0} ジョブの{1}で{2}が取得できませんでした。',
  },
  {
    id: 'MSG-FR-ERR-00098',
    message:
      '{0} ジョブの{1}呼出し時にエラーが発生しました。ステータスコード:{3}',
  },
  {
    id: 'MSG-FR-ERR-00099',
    message: '{0} ジョブの{1}にてエラーが発生しました。エラーメッセージ:{2}',
  },
  {
    id: 'MSG-FR-ERR-00100',
    message: '{0} ジョブの{1}処理にてエラーが発生しました。対象レコード:{2}',
  },
  {
    id: 'MSG-FR-ERR-00101',
    message: '{0} {1}のロックに失敗しました。{2}：{3}',
  },
  {
    id: 'MSG-FR-ERR-00102',
    message: '{0} {1}の更新に失敗しました。{2}：{3}、{4}：{5}',
  },
  {
    id: 'MSG-FR-ERR-00103',
    message: '{0} {1}の更新に失敗しました。{2}：{3}、{4}：{5}、{6}：{7}',
  },
  {
    id: 'MSG-FR-ERR-00104',
    message: '{0}バッチの{1}処理でエラーが発生しました。',
  },
  {
    id: 'MSG-FR-ERR-00105',
    message: '{0}ジョブの{1}処理にてエラーが発生しました。',
  },
  {
    id: 'MSG-FR-ERR-00106',
    message:
      '{0}ジョブの{1}処理でエラーが発生しました。{2}：{3}で{4}に更新できませんでした。',
  },
  {
    id: 'MSG-FR-ERR-00107',
    message: '{0}{1}のコミットに失敗しました。{2}：{3]',
  },
  {
    id: 'MSG-FR-ERR-00108',
    message: '{0}の項目チェックに失敗しました。{1}：{2]',
  },
  {
    id: 'MSG-FR-ERR-00109',
    message: '{0}の項目チェックに失敗しました。{1}：{2]',
  },
  {
    id: 'MSG-FR-ERR-00110',
    message: '該当車両が存在しません',
  },
  {
    id: 'MSG-FR-ERR-00111',
    message: '該当のオークション開催日が存在しません。',
  },
  {
    id: 'MSG-FR-ERR-00112',
    message: '該当のオークション回数が存在しません。',
  },
  {
    id: 'MSG-FR-ERR-00113',
    message: '直送打ちとして設定されているため、入力対象外です。',
  },
  {
    id: 'MSG-FR-ERR-00114',
    message: '必須書類情報が入力済みのため、入力対象外です。',
  },
  {
    id: 'MSG-FR-ERR-00115',
    message: '登録番号が入力されていません。',
  },
  {
    id: 'MSG-FR-ERR-00116',
    message: '登録番号が入力されています。',
  },
  {
    id: 'MSG-FR-ERR-00117',
    message: '必須書類情報、または備品情報が入力済みのため、入力対象外です。',
  },
  {
    id: 'MSG-FR-ERR-00118',
    message: '複数月の明細が選択されています。同時に申請はできません。',
  },
  {
    id: 'MSG-FR-ERR-00119',
    message: '引落結果が結果待ちの明細が選択されています。',
  },
  {
    id: 'MSG-FR-ERR-00120',
    message: '明細を設定してください。',
  },
  {
    id: 'MSG-FR-ERR-00122',
    message: '{0}と{1}は同時に入力できません。',
  },
  {
    id: 'MSG-FR-ERR-00123',
    message: '計算書計上日が過去日です。',
  },
  {
    id: 'MSG-FR-ERR-00124',
    message: '計算書計上日、会計処理日は入力日と同日に設定してください。',
  },
  {
    id: 'MSG-FR-ERR-00125',
    message:
      '次の申請IDのステータスの状態が古いため、OKボタンを押下して再度画面をご確認ください。{0}',
  },
  {
    id: 'MSG-FR-ERR-00126',
    message: 'オークション結果と計算書種別に相違があります。',
  },
  {
    id: 'MSG-FR-ERR-00127',
    message: '請求金額（税込）がマイナス金額の会費請求情報が選択されています。',
  },
  {
    id: 'MSG-FR-ERR-00128',
    message: '範囲指定が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00129',
    message: '期間が正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00130',
    message: '入力内容にエラーがあります。',
  },
  {
    id: 'MSG-FR-ERR-00131',
    message: '書類到着期限日から30日を越えているため、{0}は編集できません。',
  },
  {
    id: 'MSG-FR-ERR-00132',
    message: '契約IDまたは法人ID/法人名＋請求先IDのどちらかを入力してください',
  },
  {
    id: 'MSG-FR-ERR-00133',
    message: 'システム種別と帳票名の組み合わせが正しくありません。',
  },
  {
    id: 'MSG-FR-ERR-00134',
    message: 'キャンセル伝票は入力できません。',
  },
  {
    id: 'MSG-FR-ERR-00135',
    message:
      '{0}の伝票を登録するにあたって、必須項目に値が入力されていません。',
  },
];

